// Напишите программу, которая принимает на вход пятизначное 
//число и проверяет, является ли оно палиндромом.\


//Методы

int Prompt(string message)
{
      Console.Write(message);
      string value = Console.ReadLine();
            if (value.Length != 5) 
            {
                  WriteLine("Error you need to put 5 digits number");
            }
            else
            {
      return result;
            }
}


string fivedigitsnumber = Prompt("Please put 5 digits number");

